src/cfe/КСП/InformationRegisters/КСП_СведенияОФайлахЗагрузкиЗаказовКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КСП_СведенияОФайлахЗагрузкиЗаказовКлиента</Name>
			<Comment>Хранение сведений об обработанных файлах загрузчика заказов клиента</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСП_СтатусыЗагрузкиФайловЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Режим</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСП_РежимыЗагрузкиФайловЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Журнал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/Enums/КСП_РежимыЗагрузкиФайловЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КСП_РежимыЗагрузкиФайловЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/CommonModules/КСП_ЗагрузкаЗаказовКлиентов/Ext/Module.bsl
&НаСервере
Функция ПолучитьСодержаниеЯчейки(пТабличныйДокумент, Строка, Колонка) Экспорт	
	Если Колонка = 0 Тогда
		Возврат "";
	КонецЕсли;	
	мСодержание = пТабличныйДокумент.Область("R" + Формат(Строка,"ЧГ=") + "C" + Формат(Колонка,"ЧГ=")).Текст;	
	Возврат СокрЛП(мСодержание);
КонецФункции

&НаСервере
Процедура ЗагрузкаЗаказа(ДвоичДанные, Расширение) Экспорт

	ИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичДанные.Записать(ИмяФайла);
	
	Заказ = Документы.ЗаказКлиента.СоздатьДокумент();
	Заказ.Дата = ТекущаяДата();
	Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
	Заказ.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
	//Попытка
	//	Эксель = Новый COMОбъект("Excel.Application");
	//	Эксель.DisplayAlerts = 0;
	//	Эксель.Visible = 0;
	//Исключение
	//   	Возврат;
	//КонецПопытки;
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Очистить();
    ТабличныйДокумент.Прочитать(ИмяФайла);
	
	//ЭксельКнига = Эксель.Workbooks.Open(ИмяФайла);	
	КоличествоСтраниц = 1;
	
	Для НомерЛиста = 1 По КоличествоСтраниц Цикл 
		//Лист = ЭксельКнига.Sheets(НомерЛиста);
		//КоличествоСтрок = Лист.Cells(1, 1).SpecialCells(11).Row;
		КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
		Если ЗначениеЗаполнено(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, 6, 7)) Тогда
			Заказ.КСП_Коллекция = Справочники.КоллекцииНоменклатуры.НайтиПоНаименованию(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, 6, 7));
		КонецЕсли;
		Если ЗначениеЗаполнено(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, 4, 7)) Тогда
			Заказ.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, 4, 7));
		КонецЕсли;

        МассивРазмеров = Новый Массив;
		Для НомерКолонки = 11 По 19 Цикл
			МассивРазмеров.Добавить(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, 10, НомерКолонки));
		КонецЦикла;
		Для НомерСтроки = 13 По КоличествоСтрок Цикл
			Если ЗначениеЗаполнено(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, НомерСтроки, 4)) Тогда
				Для НомерКолонки = 11 По 19 Цикл
					Если ЗначениеЗаполнено(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, НомерСтроки, НомерКолонки)) Тогда 
						Нстр = Заказ.Товары.Добавить();
						НаименованиеТовара = ПолучитьСодержаниеЯчейки(ТабличныйДокумент, НомерСтроки, 4);
						Модель = ПолучитьСодержаниеЯчейки(ТабличныйДокумент, НомерСтроки, 5);
						Цвет = ПолучитьСодержаниеЯчейки(ТабличныйДокумент, НомерСтроки, 7);
		
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	Номенклатура.Ссылка КАК Ссылка,
							|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка1,
							|	Номенклатура.Наименование КАК Наименование
							|ИЗ
							|	Справочник.Номенклатура КАК Номенклатура
							|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
							|		ПО Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
							|ГДЕ
							|	Номенклатура.Наименование ПОДОБНО ""%"" + &Бренд + ""%""";
						Запрос.УстановитьПараметр("Бренд", НаименованиеТовара);
						Запрос.УстановитьПараметр("Размер", МассивРазмеров[НомерКолонки - 11]);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							Если СтрНайти(ВыборкаДетальныеЗаписи.Наименование, Модель) И СтрНайти(ВыборкаДетальныеЗаписи.Наименование, Цвет) Тогда
								Нстр.Номенклатура = ВыборкаДетальныеЗаписи.Ссылка;
								поискХарактеристики = "-" + СокрЛП(МассивРазмеров[НомерКолонки - 11] + "-");
								Если СтрНайти(ВыборкаДетальныеЗаписи.Ссылка1, поискХарактеристики) > 0 Тогда
									Нстр.Характеристика = ВыборкаДетальныеЗаписи.Ссылка1;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;

	//					Если ЗначениеЗаполнено(ТекТовар) Тогда
	//						Нстр.Номенклатура	= ТекТовар;
	//						Нстр.Характеристика = текХарактеристика;
	//
	//						Запрос = Новый Запрос;
	//						Запрос.Текст = 
	//							"ВЫБРАТЬ
	//							|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	//							|ИЗ
	//							|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	//							|ГДЕ
	//							|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
	//						
	//						Запрос.УстановитьПараметр("Номенклатура", ТекТовар);
	//						
	//						РезультатЗапроса = Запрос.Выполнить();
	//						
	//						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//						
	//						Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//							Нстр.КСП_БазоваяЦена = ВыборкаДетальныеЗаписи.Цена;
	//						КонецЕсли;
	//
	//					КонецЕсли;
						Нстр.КоличествоУпаковок	= Число(ПолучитьСодержаниеЯчейки(ТабличныйДокумент, НомерСтроки, НомерКолонки));
						Нстр.Цена = ПолучитьСодержаниеЯчейки(ТабличныйДокумент, НомерСтроки, 21);
						Нстр.Сумма = Нстр.КоличествоУпаковок * Нстр.Цена;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	 
	
	Попытка
		Заказ.Записать(РежимЗаписиДокумента.Запись);
		Сообщить(СокрЛП(Заказ) + " записан");
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	//Эксель.Workbooks.Close();
	//Эксель.Application.Quit();
	
	Попытка
		НоваяЗапись = РегистрыСведений.КСП_СведенияОФайлахЗагрузкиЗаказовКлиента.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.Файл = ИмяФайла;
		НоваяЗапись.Заказ = Заказ.Ссылка;
		НоваяЗапись.Режим = Перечисления.КСП_РежимыЗагрузкиФайловЗаказа.Вручную;
		НоваяЗапись.Записать();
		Сообщить("Регистр записан");
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
